Revit 2027 API
EnergyAnalysisDetailModelOptions.IncludeShadingSurfaces Property
 Indicates if to set and get the setting for if shading surfaces should be included.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IncludeShadingSurfaces { get; set; }
Public Property IncludeShadingSurfaces As Boolean
	Get
	Set
public:
property bool IncludeShadingSurfaces {
	bool get ();
	void set (bool value);
}
member IncludeShadingSurfaces : bool with get, set
Property Value
Boolean
Remarks
 The default is to include the shading surfaces.
See Also
Reference
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace